package ch09_중첩선언과익명객체.ex07_익명객체;
/**
 * 익명 객체(Anonymous Object)
 *  - 이름이 없는 객체
 *  - 명시적으로 클래스를 선언하지 않기 때문에 쉽게 객체를 생성할 수 있다.
 *  - 익명 객체는 필드값, 로컬 변수값, 매개변수값으로 주로 사용된다.
 *  - 익명 객체는 클래스를 상속하거나 인터페이스를 구현해야만 생성할 수 있다.
 *
 * 1. 익명 자식 객체
 * 	- 클래스를 상속해서 만들 경우
 * 2. 익명 구현 객체
 * 	- 인터페이스를 구현해서 만들 경우
 * 
 * 익명 자식 객체
 *  - 익명 자식 객체는 부모 클래스를 상속받아 생성된다.
 *  - 익명 자식 객체로 생성된 객체는 부모 타입의 필드, 로컬 변수, 매개변수의 값으로 대입할 수 있다.
 *  - 중괄호 블록 안의 필드와 메서드는 익명 자식 객체가 가져야 할 멤버로
 *    중괄호 블록 안에서만 사용할 수 있다.
 *  - 익명 자식 객체는 부모 타입에 대입되므로 부모 타입에 선언된 멤버만 접근 할 수 있다.
 *  - 중괄호 블록 안에는 주로 부모 메서드를 재정의하는 코드가 온다.
 *  - 익명 자식 객체가 부모 타입에 대입되면 부모 메서드 roll()을 호출할 경우,
 *  -> 재정의된 익명 자식 객체의 roll() 메서드가 실행된다.(다형성)
 *  
 * 		부모타입 변수 = new 부모생성자(매개값, ...)  {
 * 			// 필드
 * 			// 메서드
 * 		}	
 * 
 */

public class Car {
	//필드에 Tire 객체 대입
	private Tire tire1 = new Tire();

	//필드에 익명 자식 객체 대입
	private Tire tire2 = new Tire() {
		@Override
		public void roll() {
			System.out.println("익명 자식 Tire 객체 1이 굴러갑니다.");
		}
	};

	//메소드(필드 이용)
	public void run1() {
		tire1.roll();
		tire2.roll();
	}

	//메소드(로컬 변수 이용)
	public void run2() {
		//로컬 변수에 익명 자식 객체 대입
		Tire tire = new Tire() {
			@Override
			public void roll() {
				System.out.println("익명 자식 Tire 객체 2가 굴러갑니다.");
			}
		};
		tire.roll();
	}

	//메소드(매개변수 이용)
	public void run3(Tire tire) {
		tire.roll();
	}
}