package ch07_상속.ex09_추상클래스;
/**
 * 추상 클래스(abstract class)
 *  - 사전적 의미로 추상은 실체 간에 공통되는 특성을 추출한 것
 *  -> 예) 새, 곤충, 물고기 등의 공통점은 동물
 *  - 객체를 생성할 수 있는 클래스를 실체 클래스라고 한다면,
 *    이 클래스들의 공통적인 필드나 메서드를 추출해서 선언한 클래스를 추상 클래스라고 한다.
 *  - 추상 클래스는 실체 클래스의 부모 역할을 한다.
 *  - 추상 클래스는 new 연산자를 사용해서 객체를 직접 생성할 수 없다.
 * 
 * 추상 클래스 선언
 * 	- 클래스 선언에 abstract 키워드를 붙이면 추상 클래스 선언이 도니다.
 *  - 추상 클래스는 new 연산자를 이용해서 객체를 직접 만들지 못하고, 
 *    상속을 통해 자식 클래스만 만들 수 있다.
 *  - 자식 객체가 생성될 때 super()로 추상 클래스의 생성자가 호출되기 때문에 생성자도 반드시 있어야 한다.
 *    		
 * 		[접근제한자] abstract class 클래스명 {
 * 			// 필드
 * 			// 생성자
 * 			// 메서드
 * 		}
 * 
 */
public abstract class Phone {
	//필드 선언
	String owner;

	//생성자 선언
	Phone(String owner) {
		this.owner = owner;
	}

	//메소드 선언
	void turnOn() {
		System.out.println("폰 전원을 켭니다.");
	}
	void turnOff() {
		System.out.println("폰 전원을 끕니다.");
	}
}