package ch07_상속.ex07_다형성;
/**
 * 다형성(Polymorphism)
 *  - 하나의 타입(예: 부모 클래스, 인터페이스)으로 다양한 객체를 처리
 *  - 다형성을 구현하기 위해서는 자동 타입 변환과 메서드 재정의가 필요하다.
 *  
 * 필드의 다형성
 * 	- 상위 타입으로 선언된 필드에 다양한 하위 객체를 대입하여
	  동일한 코드로 서로 다른 동작을 수행하게 하는 것
 *
 * 매개변수 다형성
 *  - 메서드의 매개변수를 상위 타입으로 선언하여, 
 *    다양한 하위 객체를 인자로 전달할 수 있게 하는 것
 */
public class Car {

	//필드 선언
	// Tire 객체를 참조할 수 있는 변수
	// Car는 Tire를 가지로 있다.(has-a 관계)
	// Tire를 상위 타입으로 선언 -> 다양한 하위 객체 대입 가능 (다형성)
	// 실제 객체는 new로 생성 후 대입
	public Tire tire;

	//메소드 선언
	public void run() {
		//tire 필드에 대입된 객체의 roll() 메소드 호출
		tire.roll();
	}
}